/**
 * Author: zhangshunqiu
 * Email： 21102585@qq.com
 * 场景全局常量 2017/06/20
 */

//场景事件
const SceneEventType = {
	INIT_SCENE: "init_scenef",//初始化场景
	SCENE_INIT_COMPLETE: "init_sceneCompletef",//场景初始化完成事件

	SCENE_OBJECT_MOVE: "SCENE_OBJECT_MOVE",//场景对象移动
	HOOK_SKILL_TRIGGER: "HOOK_SKILL_TRIGGER",// 挂机技能伤害
	HOOK_SPECIAL_SKILL_TRIGGER:"HOOK_SPECIAL_SKILL_TRIGGER",//挂机特殊技能行为

	SKILL_TRIGGER: "SKILL_TRIGGER",// 技能伤害
	SHOW_SKILL_RANG_GRIDS:"SHOW_SKILL_RANG_GRIDS",// 测试显示技能格子

	UPDATE_OBJ_MODEL: "UPDATE_OBJ_MODEL",//更新角色模型
	UPDATE_HP: "UPDATE_HP",//更新血条
	SHOW_BODY_EFF: "SHOW_BODY_EFdF",//显示身上效果
	SHOW_FLY_EFF: "SCENE_ADD_FLY_EFF",//场景添加飞行效果
	SHOW_GROUP_EFF: "SCENE_ADD_GROUP_EFF",//场景添加顶部群体效果
	PLAY_COLLISION: "PLAY_COLLISION",//播放野蛮冲撞

	ADD_SCENE_OBJECT: "ADD_SCENE_OBJECT",//添加场景对象
	REMOVE_SCENE_OBJECT: "REMOVE_SCENE_OBJECT",//移除场景对象
	UPDATE_SCENE_POS: "UPDATE_SCENE_POS",//更新场景坐标

	UPDATE_HONOR_TITLE: "UPDATE_HONOR_TITLE",//更新称号

	BOSS_INFO: "BOSS_INFO",//派发BOSS信息
}


//场景地图类型
const SCENE_MAP_TYPE = {
	HOOK: 1,//挂机
	HOOK_BOSS: 2,//挂机关卡Boss
	BOOS_COPY: 3,//boss副本
	MATERICAL_COPY: 4,//材料副本
	CHALLENGE_COPY: 5,//挑战副本
	WORLD_BOSS:6,//世界BOSS
	ARENA: 9,//竞技场
	// COLLECT: 7,
	// SKILLEFF: 8,
}
//场景对象类型
const SceneObjectType = {
	PLAYER: 1,
	MONSTER: 2,
	ITEM: 3,
	PET: 4,
	NPC: 5,
	PLAYERCOPY:6,
	PARTNER: 9,
	COLLECT: 7,
	SKILLEFF: 8,
}


//场景对象动作状态
const ActState = {
	STAND: 1,//站立
	RUN: 2,//跑动
	ATTACK: 3,//攻击
	HITED: 4,//受击
	DEAD: 5,//死亡
	COLLECT: 6,//采集
}

//战斗PK模式类型0打怪模式 1 和平，2 全体，3 帮派，4 队伍，5 善恶 6新手，7仇人，8联盟
const PKModeType = {
	NONE: 0,
	PEACE: 1,
	ALL: 2,
	GUILD: 3,
	TEAM: 4,
	GOODEVIL: 5,
	NEWPLAYER: 6,
	ENEMY: 7,
	UNION: 8,
}

//攻击目标类型
const SkillTargetType = {
	SELF: 1,//自己
	PARTNER: 2,//队友
	ENEMY: 3,//敌方
	EMPTY: 4,//空放
}

/**
 * 技能攻击动作类型
 */
const SkillATKActType = {
	PHYSICS: 3,  //平砍动作
	MAGIC: 4,	//施法动作
};

/**
 * 技能攻击效果类型
 */
const SkillATKEffType = {
	ONE: 1,   	//单方向
	EIGHT: 2,	//8方向
};

/**
 * 主场景ID
 */
const MAIN_CITY_SCENE_ID = 10000;
const SCENE_AREAN_ID = 30001;

/**
 * 野蛮冲撞技能ID
 */
const SKILL_YMCZ_ID = 10300;
/**
 * 抗拒火环技能ID
 */
const SKILL_KJHH_ID = 20400;
/**
 * 召唤术技能ID
 */
const SKILL_ZHS_ID = 30500;
/**
 * 魔法盾技能ID
 */
const SKILL_MFD_ID = 20300;
/**
 * 技能伤害效果类型
 */
const SkillHurtEffType = {
	BODY_MIDDLE: 1,   	//单体身上（会从脚点上提升）
	BODY_MULTI_MIDDLE: 2,		//多人身上（会从脚点上提升）
	BODY_SURFACE: 3,	//单体或者多人身上地表(在脚点)
	GROUP_SKY: 4,		//群体空中
	GROUP_FIRE: 5,		//火墙
}

//技能攻击范围类型
//:1.单人（一个目标，单人不用到格子搜索）2.近身群体（以自己位置为起点）3.远程群体（以目标位置为起点）
const SkillAtkRangeType = {
	R_SINGLE: 1,   	//单体
	/**近身群体 */
	R_N_GROUP: 2,	//近身群体
	/**远程群体 */
	R_F_GROUP: 3,	//远程群体
}

/**
 * 怪物攻击类型
* 1;//攻击类型：1:主动攻击,2=被动攻击,3=不主动攻击不反击
*/
const MonsterAtkType = {
	AUTO: 1,//主动攻击
	PASSIVE: 2,//被动攻击
	AVOID: 3,//不主动攻击不反击
}

/**
 * 怪物类型
*/
const MONSTER_TYPE = {
	ORDINARY:1,//普通
	LEVEL_BOSS: 2,//关卡BOSS
	GENERAL_BOSS: 3,//普通boss
	WORLD_BOSS: 4,//世界boss
}

const SkillAtkRange = {
	range1: [[[0, 0]]],//单格单攻
	range2: [[[0, 0], [0, -1], [0, 1], [-1, 0], [1, 0], [1, -1], [-1, -1], [-1, 1], [1, 1]]],//3*3群攻
	range8: [[[0, 0], [0, -1], [0, 1], [-1, 0], [1, 0], [1, -1], [-1, -1], [-1, 1], [1, 1], [0, -2], [0, 2], [-2, 0], [2.0], [-1, -2], [2, -1], [1, 2], [-2, 1], [1, -2], [2, 1], [-1, 2], [-2, -1]]],//4*4群攻 圆形
	range3: [
		[],
		[[0, 0], [0, -1], [-1, 0], [1, 0], [-1, -1], [1, -1], [0, -2], [-1, -2], [1, -2], [-2, -1], [2, -1], [-2, 0], [2, 0]],
		[[0, 0], [1, -1], [1, 0], [0, -1], [1, 1], [-1, -1], [2, 0], [0, -2], [1, -2], [2, -1], [2, 1], [-1, -2], [2, -2]],
		[[0, 0], [1, 0], [1, 1], [1, -1], [0, -1], [0, 1], [2, 0], [2, 1], [2, -1], [1, -2], [1, 2], [0, -2], [0, 2]],
		[[0, 0], [1, 1], [1, 0], [0, 1], [-1, 1], [1, -1], [2, 1], [1, 2], [2, 0], [0, 2], [2, -1], [-1, 2], [2, 2]],
		[[0, 0], [0, 1], [1, 1], [-1, 1], [1, 0], [-1, 0], [0, 2], [-1, 2], [1, 2], [-2, 1], [2, 1], [-2, 0], [2, 0]],
		[[0, 0], [-1, 1], [-1, 0], [0, 1], [1, 1], [-1, -1], [-1, 2], [-2, 1], [0, 2], [-2, 0], [-2, 2], [-2, -1], [1, 2]],
		[[0, 0], [-1, 0], [-1, -1], [-1, 1], [0, 1], [0, -1], [-2, 0], [-2, -1], [-2, 1], [-1, 2], [-1, -2], [0, 2], [0, -2]],
		[[0, 0], [-1, -1], [-1, 0], [0, -1], [1, -1], [-1, 1], [-2, -1], [-1, -2], [-2, 0], [0, -2], [-2, 1], [1, -2], [-2, -2]]
	],//半月弯刀 周围半月形，半圆
	range4: [
		[],
		[[0, -1], [0, -2]],
		[[1, -1], [2, -2]],
		[[1, 0], [2, 0]],
		[[1, 1], [2, 2]],
		[[0, 1], [0, 2]],
		[[-1, 1], [-2, 2]],
		[[-1, 0], [-2, 0]],
		[[-1, -1], [-2, -2]]
	],//前方2个格子
	range5: [
		[],
		[[0, -1], [0, -2], [0, -3], [-1, -2], [1, -2]],
		[[1, -1], [2, -2], [1, -2], [2, -1]],
		[[1, 0], [2, 0], [3, 0], [2, -1], [2, 1]],
		[[1, 1], [2, 2], [2, 1], [1, 2]],
		[[0, 1], [0, 2], [0, 3], [-1, 2], [1, 2]],
		[[-1, 1], [-2, 2], [-2, 1], [-1, 2]],
		[[-1, 0], [-2, 0], [-3, 0], [-2, -1], [-2, 1]],
		[[-1, -1], [-2, -2], [-1, -2], [-2, -1]]
	],// 前方3个格子
	range6: [
		[],
		[[0, -1], [0, -2], [0, -3], [0, -4], [-1, -2], [1, -2], [-1, -3], [1, -3]],
		[[1, -1], [2, -2], [3, -3], [1, -2], [2, -1], [2, -3], [3, -2]],
		[[1, 0], [2, 0], [3, 0], [4, 0], [2, -1], [2, 1], [3, -1], [3, 1]],
		[[1, 1], [2, 2], [3, 3], [2, 1], [1, 2], [3, 2], [2, 3]],
		[[0, 1], [0, 2], [0, 3], [0, 4], [-1, 2], [1, 2], [-1, 3], [1, 3]],
		[[-1, 1], [-2, 2], [-3, 3], [-2, 1], [-1, 2], [-3, 2], [-2, 3]],
		[[-1, 0], [-2, 0], [-3, 0], [-4, 0], [-2, -1], [-2, 1], [-3, -1], [-3, 1]],
		[[-1, -1], [-2, -2], [-3, -3], [-1, -2], [-2, -1], [-2, -3], [-3, -2]]
	],// 前方4格子
	range7: [
		[],
		[[0, -1], [0, -2], [0, -3], [0, -4], [0, -5], [-1, -2], [1, -2], [-1, -3], [1, -3], [-1, -4], [1, -4]],
		[[1, -1], [2, -2], [3, -3], [4, -4], [1, -2], [2, -1], [2, -3], [3, -2], [3, -4], [4, -3]],
		[[1, 0], [2, 0], [3, 0], [4, 0], [5, 0], [2, -1], [2, 1], [3, -1], [3, 1], [4, -1], [4, 1]],
		[[1, 1], [2, 2], [3, 3], [4, 4], [2, 1], [1, 2], [3, 2], [2, 3], [4, 3], [3, 4]],
		[[0, 1], [0, 2], [0, 3], [0, 4], [0, 5], [-1, 2], [1, 2], [-1, 3], [1, 3], [-1, 4], [1, 4]],
		[[-1, 1], [-2, 2], [-3, 3], [-4, 4], [-2, 1], [-1, 2], [-3, 2], [-2, 3], [-4, 3], [-3, 4]],
		[[-1, 0], [-2, 0], [-3, 0], [-4, 0], [-5, 0], [-2, -1], [-2, 1], [-3, -1], [-3, 1], [-4, -1], [-4, 1]],
		[[-1, -1], [-2, -2], [-3, -3], [-4, -4], [-1, -2], [-2, -1], [-2, -3], [-3, -2], [-3, -4], [-4, -3]]
	],// 前方5格

	range11: [[[0, -1], [0, 1], [-1, 0], [1, 0], [1, -1], [-1, -1], [-1, 1], [1, 1]]],//3*3群攻中间的不受伤害，周围的受伤害 隔山打牛
	range22: [[[0, -1], [0, 1], [-1, 0], [1, 0], [1, -1], [-1, -1], [-1, 1], [1, 1], [0, -2], [0, 2], [-2, 0], [2.0], [-1, -2], [2, -1], [1, 2], [-2, 1], [1, -2], [2, 1], [-1, 2], [-2, -1]]],//4*4群攻 圆形中间的不受伤害，周围的受伤害
	range23: [[[0, -1], [0, 1], [-1, 0], [1, 0], [1, -1], [-1, -1], [-1, 1], [1, 1], [0, -2], [0, 2], [-2, 0], [2.0], [-1, -2], [2, -1], [1, 2], [-2, 1], [1, -2], [2, 1], [-1, 2], [-2, -1]]],//4*4群攻 圆形中间的不受伤害，周围的受伤害
}
//野蛮冲撞正面格子路径
const BumpFrontGrids = [
	[],
	[
	[],
	[[0, -1], [0, -2]],
	[[1, -1]],
	[[1, 0], [2, 0]],
	[[1, 1]],
	[[0, 1], [0, 2]],
	[[-1, 1]],
	[[-1, 0], [-2, 0]],
	[[-1, -1]]
	],
	[
	[],
	[[0, -1], [0, -2], [0, -3]],
	[[1, -1], [2, -2]],
	[[1, 0], [2, 0], [3, 0]],
	[[1, 1], [2, 2]],
	[[0, 1], [0, 2], [0, 3]],
	[[-1, 1], [-2, 2], [-3, 3]],
	[[-1, 0], [-2, 0], [-3, 0]],
	[[-1, -1], [-2, -2]]
	],
	[
	[],
	[[0, -1], [0, -2], [0, -3], [0, -4]],
	[[1, -1], [2, -2], [3, -3]],
	[[1, 0], [2, 0], [3, 0], [4, 0]],
	[[1, 1], [2, 2], [3, 3]],
	[[0, 1], [0, 2], [0, 3], [0, 4]],
	[[-1, 1], [-2, 2], [-3, 3]],
	[[-1, 0], [-2, 0], [-3, 0], [-4, 0]],
	[[-1, -1], [-2, -2], [-3, -3]]
	]
];
//野蛮冲撞反面格子路径
const BumpBackGrids = [
	[],
	[[0, 1], [0, 2], [0, 3], [0, 4]],
	[[-1, 1], [-2, 2], [-3, 3]],
	[[-1, 0], [-2, 0], [-3, 0], [-4, 0]],
	[[-1, -1], [-2, -2], [-3, -3]],
	[[0, -1], [0, -2], [0, -3], [0, -4]],
	[[1, -1], [2, -2], [3, -3]],
	[[1, 0], [2, 0], [3, 0], [4, 0]],
	[[1, 1], [2, 2], [3, 3]],
];

//火墙格子
const FireWallGrids = [[0, 0], [0, -1], [0, 1], [-1, 0], [1, 0], [1, -1], [-1, -1], [-1, 1], [1, 1]];

// //当前方向前面8个格子格子坐标偏移量
// const FrontGridsByDire = [
// 	[],
// 	[[0,-1],[0,-2],[0,-3],[0,-4]],
// 	[[1,-1],[2,-2],[3,-3],[4,-4]],
// 	[[1,0],[2,0],[3,0],[4,0]],
// 	[[1,1],[2,2],[3,3],[4,4]],
// 	[[0,1],[0,2],[0,3],[0,4]],
// 	[[-1,1],[-2,2],[-3,3],[-4,4]],
// 	[[-1,0],[-2,0],[-3,0],[-4,0]],
// 	[[-1,-1],[-2,-2],[-3,-3],[-4,-4]]
// ];
//八方向格子偏移量1
const EightDireGridOffSet1 = [[0, 0], [0, -1], [1, -1], [1, 0], [1, 1], [0, 1], [-1, 1], [-1, 0], [-1, -1]];
//八方向格子偏移量2
const EightDireGridOffSet2 = [[0, 2], [0, -2], [-2, 0], [2, 0], [1, -2], [2, 1], [-1, 2], [-2, -1], [-1, -2], [2, -1], [1, 2], [-2, 1]];
//八方向格子偏移量3 3个的没有搜2个的
const EightDireGridOffSet3 = [[0, 3], [0, -3], [-3, 0], [3, 0], [2, -2], [2, 2], [-2, 2], [-2, -2]];
//八方向格子偏移量4 4个的没有搜3个的
const EightDireGridOffSet4 = [[0, 4], [0, -4], [-4, 0], [4, 0], [3, -3], [3, 3], [-3, 3], [-3, -3]];

/**
 * 自动技能配置信息
 */
const AutoSkillConfig = [
	[50000],
	[10200, 10100, 10300, 10400, 10500],
	[20100, 20200, 20300, 20400, 20500],
	[30100, 30200, 30300, 30500, 30400]
];

/**
 * 八方向1方向和缩放值常量
 */
const DireScaleType1: DireScale = new DireScale(1, 1, 1);
/**
 * 八方向2方向和缩放值常量
 */
const DireScaleType2: DireScale = new DireScale(2, 1, 2);
/**
 * 八方向3方向和缩放值常量
 */
const DireScaleType3: DireScale = new DireScale(3, 1, 3);
/**
 * 八方向4方向和缩放值常量
 */
const DireScaleType4: DireScale = new DireScale(4, 1, 4);
/**
 * 八方向5方向和缩放值常量
 */
const DireScaleType5: DireScale = new DireScale(5, 1, 5);
/**
 * 八方向6方向和缩放值常量
 */
const DireScaleType6: DireScale = new DireScale(4, -1, 6);
/**
 * 八方向7方向和缩放值常量
 */
const DireScaleType7: DireScale = new DireScale(3, -1, 7);
/**
 * 八方向8方向和缩放值常量
 */
const DireScaleType8: DireScale = new DireScale(2, -1, 8);
/*
* 八方向和缩放值常量
*/
const DireScaleType: Array<DireScale> = [
	DireScaleType5,
	DireScaleType1,
	DireScaleType2,
	DireScaleType3,
	DireScaleType4,
	DireScaleType5,
	DireScaleType6,
	DireScaleType7,
	DireScaleType8,
];

/*
* 八方向反方向值常量
*/
const DireScaleReverseType: Array<DireScale> = [
	DireScaleType5,
	DireScaleType5,
	DireScaleType6,
	DireScaleType7,
	DireScaleType8,
	DireScaleType1,
	DireScaleType2,
	DireScaleType3,
	DireScaleType4,
];

//方向角度值(弧度)
const DireAngle1: number = 90 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle2: number = 135 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle3: number = 180 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle4: number = -135 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle5: number = -90 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle6: number = -45 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle7: number = 0 * Math.PI / 180;
//方向角度值(弧度)
const DireAngle8: number = 45 * Math.PI / 180;
/*
* 八方向角度值常量
*/
const DireAngleType: Array<number> = [
	0,
	DireAngle1,
	DireAngle2,
	DireAngle3,
	DireAngle4,
	DireAngle5,
	DireAngle6,
	DireAngle7,
	DireAngle8,
];

/**
 * 场景滤镜类型
 */ 
const SceneFiltersType = {
	NULL: 0,
	GRAY: 1,
	RED: 2,
	BLUE: 3,
	GREEN: 4,
	WHITE: 5,
}
/**
 * 滤镜
 */
const SceneFilters = [
	[],
	[new egret.ColorMatrixFilter([0.3, 0.6, 0, 0, 0, 0.3, 0.6, 0, 0, 0, 0.3, 0.6, 0, 0, 0, 0, 0, 0, 1, 0])],
	[new egret.ColorMatrixFilter([1, 0, 0, 0, 200,0, 1, 0, 0, 0,0, 0, 1, 0, 0,0, 0, 0, 1, 0])],
	[new egret.ColorMatrixFilter([1, 0, 0, 0, 0,0, 1, 0, 0, 0,0, 0, 1, 0, 200,0, 0, 0, 1, 0])],
	[new egret.ColorMatrixFilter([1, 0, 0, 0, 0,0, 1, 0, 0, 200,0, 0, 1, 0, 0,0, 0, 0, 1, 0])],
	[new egret.ColorMatrixFilter([1, 0, 0, 0, 200,0, 1, 0, 0, 200,0, 0, 1, 0, 200,0, 0, 0, 1, 0])],
]

/**
 * buff 效果类型
 */
const BuffEffType={
	NULL: 0,//空
	/**减伤 */
	REDUCE_HURT:1, 
	ATTADD: 2,//属性加成
	/**烈火 */
	FIRE: 3,//烈火
	/**眩晕 */
	DIZZY: 4,//眩晕
	/** 中毒*/
	POISON: 5,//中毒
	/**吸血 */
	SUCkBLOOD:6,
	/**麻痹 */
	PARALYSIS:7,
	CURE: 8,//治疗
	ADDEXP: 9,//经验
	/**沉默 */
	SILENT: 10,//沉默
	/**隐身 */
	INVISIBLE: 11,//隐身
	/**石化 */
	STONE: 12,//石化
	/**魔法盾 */
	SHIELD: 13,//魔法盾
	
}